buckia keyring to env
